ontwikkel_nvwa/unauthicated.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v4="http://ec.europa.eu/sanco/tracesnt/base/v4"
                  xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                  xmlns:v1="http://ec.europa.eu/tracesnt/referencedata/v1"
                  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <soapenv:Header>
        <v4:LanguageCode>nl</v4:LanguageCode>
        <v4:WebServiceClientId>vgc-client</v4:WebServiceClientId>
        <oas:Security>
            <oas:UsernameToken wsu:Id="UsernameToken-A5B8D7123A55CB6A75153751937547586">
                <oas:Username>n0039qig</oas:Username>
                <oas:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
                    lrw902UbsYfsUkZPHbZnnmeHSY4=
                </oas:Password>
                <oas:Nonce>REFqaHpFeW1iV2dxc3pOQw==</oas:Nonce>
                <wsu:Created>2022-11-23T15:48:41.307Z</wsu:Created>
            </oas:UsernameToken>
            <wsu:Timestamp>
                <wsu:Created>2022-11-23T15:48:41.307Z</wsu:Created>
                <wsu:Expires>2022-11-23T15:48:41.307Z</wsu:Expires>
            </wsu:Timestamp>
        </oas:Security>
    </soapenv:Header>
    <soapenv:Body>
        <v1:GetClassificationTreeUpdatesRequest>
            <v1:TreeID>chedp</v1:TreeID>
            <v1:UpdateDateTimeRange>
                <v4:From>2022-02-01T00:00:00.000+02:00</v4:From>
                <v4:To>2022-03-01T00:00:00.000+02:00</v4:To>
            </v1:UpdateDateTimeRange>
        </v1:GetClassificationTreeUpdatesRequest>
    </soapenv:Body>
</soapenv:Envelope>